app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfgh"], ["body", "a"], ["created_at", "2020-01-14 08:45:35.562462"], ["updated_at", "2020-01-14 08:45:35.562462"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
     book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "リーダブルコード"], ["body", "リーダブルコード"], ["updated_at", "2020-01-13 14:15:24.352502"], ["id", 1]]